# -*- coding: utf-8 -*-
"""
Задание 4.7

Преобразовать MAC-адрес в строке mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

mac = "AAAA:BBBB:CCCC"

mac_tmp = mac.replace(':', '')
b = bin(int(mac_tmp, 16))
b = str(b).lstrip('0b')

print(b)
